perf/calc.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery_gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Simple
      duration: 60
      arrivalRate: 50
    - name: Medium
      duration: 60
      arrivalRate: 150
    - name: Heavy
      duration: 60
      arrivalRate: 300
    - name: SuperHeavy
      duration: 60
      arrivalRate: 600      

scenarios:
  - name: Calc (/calc)
    flow:
      - get:
          url: '/calc'